**Conceptos basicos de bases de datos**

SERVIDOR: Es un programa que provee serviciops de bases de datos a otros programas u otras computadoras

HOST NAME: Ubicacion en la red del servidor en la base de datos (Dominio o IP)

USER:En nuestro caso sera root pro puee cambiarse este es el nomre del ususario

PASSWORD: Es la contrasenia que tiene nuestro cliente para poder conectarnos a nuestro servidor 

BASE DE DATOS: Conjuento de datos perteneciente a un mismo contexto y almacenados sistematicamente para su posterior uso

TABLAS: Se refiere a un tipo de modelado de datos donde se guardatan los datos recogidos

CAMPO: Corresponde al nombre de la columna

REGISTRO: Corresponde a cada fila que compone la tabla

#Dar de lata el sericio de apache desde powershel

cd.. 
cd..
cd .\Apache24\
cd .\bin\
.\httpd.exe

#instalar como servicio apache 
.\httpd.exe -k install

**NAVEGACION BASICA EN MYSQL**

#Ingresar a  MYSQL desde cmd
C:\Users\tachy>mysql -u root -p

#Ver todas las bases de datos disponibles 
mysql> show databases
    -> ;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| sakila             |
| sys                |
| world              |
+--------------------+

#Crear una base de datos
mysql> create database appsalon;

#Usar una base de datos existente 
mysql> use appsalon;

#Ver todas las tablas creadas en esa base de datos
mysql> show tables;

#Crear un tabla en la base de datos 
mysql> create table Servicios(
    -> id_servicio int(11) not null auto_increment,
    -> nombre varchar(60) not null,
    -> precio decimal(7,2) not null,
    -> primary key(id_servicio)
    -> );

#Ver las caracteristicas y elemetos de una tabla 
mysql> describe servicios;
+-------------+--------------+------+-----+---------+----------------+
| Field       | Type         | Null | Key | Default | Extra          |
+-------------+--------------+------+-----+---------+----------------+
| id_servicio | int          | NO   | PRI | NULL    | auto_increment |
| nombre      | varchar(60)  | NO   |     | NULL    |                |
| precio      | decimal(7,2) | NO   |     | NULL    |                |
+-------------+--------------+------+-----+---------+----------------+

**CRUD**

**CREATE**

#CREATE Insertar datos a una tabla 
mysql> insert into servicios (nombre, precio) values ("corte de cabello de adulto",80);

#Insertar mas de un elemento a una tabla 
mysql> insert into servicios(nombre, precio) values
    -> ("peinado mujer" ,80),
    -> ("peinado hombre" ,60);

**READ**

#READ Leer los datos de una tabla 

mysql> select * from servicios;
+-------------+----------------------------+--------+
| id_servicio | nombre                     | precio |
+-------------+----------------------------+--------+
|           1 | corte de cabello de adulto |  80.00 |
|           2 | corte de cabello ninio     |  60.00 |
|           3 | peinado hombre             |  60.00 |
|           4 | peinado mujer              |  80.00 |
+-------------+----------------------------+--------+

#Ver solo una columna de la base de datos
mysql> select nombre from servicios;
+----------------------------+
| nombre                     |
+----------------------------+
| corte de cabello de adulto |
| corte de cabello ninio     |
| peinado hombre             |
| peinado mujer              |
+----------------------------+

#leer datos especificos 
mysql> select nombre,precio from servicios;
+----------------------------+--------+
| nombre                     | precio |
+----------------------------+--------+
| corte de cabello de adulto |  80.00 |
| corte de cabello ninio     |  60.00 |
| peinado hombre             |  60.00 |
| peinado mujer              |  80.00 |
+----------------------------+--------+


#Ordenando los datos conforme al precio 
mysql> select id_servicio,nombre, precio from servicios order by precio;
+-------------+----------------------------+--------+
| id_servicio | nombre                     | precio |
+-------------+----------------------------+--------+
|           2 | corte de cabello ninio     |  60.00 |
|           3 | peinado hombre             |  60.00 |
|           1 | corte de cabello de adulto |  80.00 |
|           4 | peinado mujer              |  80.00 |
+-------------+----------------------------+--------+

#Ordenando de mayor a menor 
mysql> select id_servicio,nombre, precio from servicios order by precio desc;
+-------------+----------------------------+--------+
| id_servicio | nombre                     | precio |
+-------------+----------------------------+--------+
|           1 | corte de cabello de adulto |  80.00 |
|           4 | peinado mujer              |  80.00 |
|           2 | corte de cabello ninio     |  60.00 |
|           3 | peinado hombre             |  60.00 |
+-------------+----------------------------+--------+

#Ordenando de menor a mayor 
mysql> select id_servicio,nombre, precio from servicios order by precio asc;
+-------------+----------------------------+--------+
| id_servicio | nombre                     | precio |
+-------------+----------------------------+--------+
|           2 | corte de cabello ninio     |  60.00 |
|           3 | peinado hombre             |  60.00 |
|           1 | corte de cabello de adulto |  80.00 |
|           4 | peinado mujer              |  80.00 |
+-------------+----------------------------+--------+

#Ordenar deacuerdo al id de forma decendente y limitar los resultados a dos 
mysql> select id_servicio,nombre, precio from servicios order by id_servicio desc limit 2;
+-------------+----------------+--------+
| id_servicio | nombre         | precio |
+-------------+----------------+--------+
|           4 | peinado mujer  |  80.00 |
|           3 | peinado hombre |  60.00 |
+-------------+----------------+--------+

#Obtener el resultado deacuerdo a un id en especifico 
mysql> select id_servicio, nombre, precio from servicios where id_servicio = 3;
+-------------+----------------+--------+
| id_servicio | nombre         | precio |
+-------------+----------------+--------+
|           3 | peinado hombre |  60.00 |
+-------------+----------------+--------+

**UPDATE**

#UPDATE elegimos la tabla a actualizar y el campo cuyo valor cambiaremos con el id indicado
mysql> update servicios set precio = 70 where id_servicio = 2;


mysql> update servicios set nombre = "Corte de cabello de ninio actualizado" where id_servicio = 2;

**DELETE**

#Eliminar de la tabla servicios la columna con id =1 
mysql> delete from servicios where id_servicio = 1;

#Eliminar de la tabla servicios la columna con id = 4
mysql> delete from servicios where id_servicio = 4;

**Agregar una tabla a una bd**

#Cambiamos la tabla servicios y se agrega la columna descripcion 
mysql> alter table servicios add descripcion varchar(100) not null;

#Cambiamos el nombre de la tabla y la cantidad de caracteres 
mysql> alter table servicios change descripcion  nuevonombre varchar(11) not null;

**Eliminar una columna en una tabla**

mysql> alter table servicios drop column descripcion;

**ELIMINAR UNA TABLA**

mysql> DROP TABLE servicios;

**Creando tablas de nuevo**

mysql> create table servicios(
    -> id int(11) not null auto_increment,
    -> nombre varchar(60) not null,
    -> precio decimal(6,2) not null,
    -> primary key (id)
    -> );


mysql> create table reservaciones(
    -> id int(11) not null auto_increment,
    -> nombre varchar(60) not null,
    -> apellido varchar(60) not null,
    -> hora time default null,
    -> fecha date default null,
    -> servicios varchar(255) not null,
    -> primary key(id)
    -> );

**Insertar datos a las tablas**

mysql>         INSERT INTO reservaciones (nombre, apellido, hora, fecha, servicios) VALUES
    ->         ('Juan', 'De la torre', '10:30:00', '2021-06-28', 'Corte de Cabello Adulto, Corte de Barba' ),
    ->         ('Antonio', 'Hernandez', '14:00:00', '2021-07-30', 'Corte de Cabello Niño'),
    ->         ('Pedro', 'Juarez', '20:00:00', '2021-06-25', 'Corte de Cabello Adulto'),
    ->         ('Mireya', 'Perez', '19:00:00', '2021-06-25', 'Peinado Mujer'),
    ->         ('Jose', 'Castillo', '14:00:00', '2021-07-30', 'Peinado Hombre'),
    ->         ('Maria', 'Diaz', '14:30:00', '2021-06-25', 'Tinte'),
    ->         ('Clara', 'Duran', '10:00:00', '2021-07-01', 'Uñas, Tinte, Corte de Cabello Mujer'),
    ->         ('Miriam', 'Ibañez', '09:00:00', '2021-07-01', 'Tinte'),
    ->         ('Samuel', 'Reyes', '10:00:00', '2021-07-02', 'Tratamiento Capilar'),
    ->         ('Joaquin', 'Muñoz', '19:00:00', '2021-06-28', 'Tratamiento Capilar'),
    ->         ('Julia', 'Lopez', '08:00:00', '2021-06-25', 'Tinte'),
    ->         ('Carmen', 'Ruiz', '20:00:00', '2021-07-01', 'Uñas'),
    ->         ('Isaac', 'Sala', '09:00:00', '2021-07-30', 'Corte de Cabello Adulto'),
    ->         ('Ana', 'Preciado', '14:30:00', '2021-06-28', 'Corte de Cabello Mujer'),
    ->         ('Sergio', 'Iglesias', '10:00:00', '2021-07-02', 'Corte de Cabello Adulto'),
    ->         ('Aina', 'Acosta', '14:00:00', '2021-07-30', 'Uñas'),
    ->         ('Carlos', 'Ortiz', '20:00:00', '2021-06-25', 'Corte de Cabello Niño'),
    ->         ('Roberto', 'Serrano', '10:00:00', '2021-07-30', 'Corte de Cabello Niño'),
    ->         ('Carlota', 'Perez', '14:00:00', '2021-07-01', 'Uñas'),
    ->         ('Ana Maria', 'Igleias', '14:00:00', '2021-07-02', 'Uñas, Tinte'),
    ->         ('Jaime', 'Jimenez', '14:00:00', '2021-07-01', 'Corte de Cabello Niño'),
    ->         ('Roberto', 'Torres', '10:00:00', '2021-07-02', 'Corte de Cabello Adulto'),
    ->         ('Juan', 'Cano', '09:00:00', '2021-07-02', 'Corte de Cabello Niño'),
    ->         ('Santiago', 'Hernandez', '19:00:00', '2021-06-28', 'Corte de Cabello Niño'),
    ->         ('Berta', 'Gomez', '09:00:00', '2021-07-01', 'Uñas'),
    ->         ('Miriam', 'Dominguez', '19:00:00', '2021-06-28', 'Corte de Cabello Niño'),
    ->         ('Antonio', 'Castro', '14:30:00', '2021-07-02', 'Corte de Cabello Adulti'),
    ->         ('Hugo', 'Alonso', '09:00:00', '2021-06-28', 'Corte de Barba'),
    ->         ('Victoria', 'Perez', '10:00:00', '2021-07-02', 'Uñas, Tinte'),
    ->         ('Jimena', 'Leon', '10:30:00', '2021-07-30', 'Uñas, Corte de Cabello Mujer'),
    ->         ('Raquel' ,'Peña', '20:30:00', '2021-06-25', 'Corte de Cabello Mujer');


    mysql>     INSERT INTO servicios ( nombre, precio ) VALUES
    ->         ('Corte de Cabello Niño', 60),
    ->         ('Corte de Cabello Hombre', 80),
    ->         ('Corte de Barba', 60),
    ->         ('Peinado Mujer', 80),
    ->         ('Peinado Hombre', 60),
    ->         ('Tinte',300),
    ->         ('Uñas', 400),
    ->         ('Lavado de Cabello', 50),
    ->         ('Tratamiento Capilar', 150);

**SELECTORES POR CONDICIONALES**

#Mayor que 
mysql> select * from servicios where precio > 90;
+----+---------------------+--------+
| id | nombre              | precio |
+----+---------------------+--------+
|  6 | Tinte               | 300.00 |
|  7 | Uñas                | 400.00 |
|  9 | Tratamiento Capilar | 150.00 |
+----+---------------------+--------+

#Mayor igual 
mysql> select * from servicios where precio >= 80;
+----+-------------------------+--------+
| id | nombre                  | precio |
+----+-------------------------+--------+
|  2 | Corte de Cabello Hombre |  80.00 |
|  4 | Peinado Mujer           |  80.00 |
|  6 | Tinte                   | 300.00 |
|  7 | Uñas                    | 400.00 |
|  9 | Tratamiento Capilar     | 150.00 |
+----+-------------------------+--------+

#Elegir valores dentro de un rango
mysql> select * from servicios where precio between 100 and 200;
+----+---------------------+--------+
| id | nombre              | precio |
+----+---------------------+--------+
|  9 | Tratamiento Capilar | 150.00 |
+----+---------------------+--------+

#Suma a todos los usuarios que tienen citas en las mismas fechas y las muestra
mysql> select count(id), fecha
    -> from reservaciones
    -> group by fecha
    -> order by count(id) desc;
+-----------+------------+
| count(id) | fecha      |
+-----------+------------+
|         7 | 2021-07-02 |
|         6 | 2021-06-28 |
|         6 | 2021-07-30 |
|         6 | 2021-06-25 |
|         6 | 2021-07-01 |
+-----------+------------+

#Suma todas las cantidades de una columna y la muestra 
mysql> select sum(precio) as totalServicios from servicios;
+----------------+
| totalServicios |
+----------------+
|        1240.00 |
+----------------+
1 row in set (0.00 sec)

#Selecciona la minima cantidad de una columna 
mysql> select min(precio) as precioMenor from servicios;
+-------------+
| precioMenor |
+-------------+
|       50.00 |
+-------------+
1 row in set (0.00 sec)

#Selecciona la maxima cantidad de una columna 
mysql> select max(precio)  as  precioMenor from servicios;
+-------------+
| precioMenor |
+-------------+
|      400.00 |
+-------------+

#Busca la palabra "corte" al principio de cada enunciado
mysql> select * from servicios where nombre like "corte%";
+----+-------------------------+--------+
| id | nombre                  | precio |
+----+-------------------------+--------+
|  1 | Corte de Cabello Niño   |  60.00 |
|  2 | Corte de Cabello Hombre |  80.00 |
|  3 | Corte de Barba          |  60.00 |
+----+-------------------------+--------+
3 rows in set (0.00 sec)


#Busca la palabra "lavado" al final de una oracion 
mysql> select * from servicios where nombre like "%cabello";
+----+-------------------+--------+
| id | nombre            | precio |
+----+-------------------+--------+
|  8 | Lavado de Cabello |  50.00 |
+----+-------------------+--------+
1 row in set (0.00 sec)

#Busca la palabra "cabello" en cualquier seccion 
mysql> select * from servicios where nombre like "%cabello%";
+----+-------------------------+--------+
| id | nombre                  | precio |
+----+-------------------------+--------+
|  1 | Corte de Cabello Niño   |  60.00 |
|  2 | Corte de Cabello Hombre |  80.00 |
|  8 | Lavado de Cabello       |  50.00 |
+----+-------------------------+--------+
3 rows in set (0.00 sec)

#Une los datos de dos columnas, despues se muetran en una tabla temporal que llamamos "nombreCompleto"
mysql> select concat(nombre , " ",apellido) as nombreCompleto from reservaciones;
+--------------------+
| nombreCompleto     |
+--------------------+
| Juan De la torre   |
| Antonio Hernandez  |
| Pedro Juarez       |
| Mireya Perez       |
| Jose Castillo      |
| Maria Diaz         |
| Clara Duran        |
| Miriam Ibañez      |
| Samuel Reyes       |
| Joaquin Muñoz      |
| Julia Lopez        |
| Carmen Ruiz        |
| Isaac Sala         |
| Ana Preciado       |
| Sergio Iglesias    |
| Aina Acosta        |
| Carlos Ortiz       |
| Roberto Serrano    |
| Carlota Perez      |
| Ana Maria Igleias  |
| Jaime Jimenez      |
| Roberto Torres     |
| Juan Cano          |
| Santiago Hernandez |
| Berta Gomez        |
| Miriam Dominguez   |
| Antonio Castro     |
| Hugo Alonso        |
| Victoria Perez     |
| Jimena Leon        |
| Raquel Peña        |
+--------------------+

#Buscamos en la tabla reservaciones cuando el nombre concatenado de las columnas nombre y apellido es igual al buscado con %ana preciado%
mysql> select * from reservaciones
    -> where concat(nombre, " ",apellido) like "%ana preciado%";
+----+--------+----------+----------+------------+------------------------+
| id | nombre | apellido | hora     | fecha      | servicios              |
+----+--------+----------+----------+------------+------------------------+
| 14 | Ana    | Preciado | 14:30:00 | 2021-06-28 | Corte de Cabello Mujer |
+----+--------+----------+----------+------------+------------------------+
1 row in set (0.00 sec)

#Muestra las coincidencias de hora y fecha cuyo valor de columnas concatenadas nombre y apellido de el valor de anna preciado
mysql> select hora,fecha, concat(nombre," ",apellido) as "Nombre Completo"
    -> from reservaciones
    -> where concat(nombre, " ",apellido)
    -> like "%ana preciado%";
+----------+------------+-----------------+
| hora     | fecha      | Nombre Completo |
+----------+------------+-----------------+
| 14:30:00 | 2021-06-28 | Ana Preciado    |
+----------+------------+-----------------+

#Selecciona mas de un id al mismo tiempo 
mysql> select*from reservaciones where id in(1,3);
+----+--------+-------------+----------+------------+-----------------------------------------+
| id | nombre | apellido    | hora     | fecha      | servicios                               |
+----+--------+-------------+----------+------------+-----------------------------------------+
|  1 | Juan   | De la torre | 10:30:00 | 2021-06-28 | Corte de Cabello Adulto, Corte de Barba |
|  3 | Pedro  | Juarez      | 20:00:00 | 2021-06-25 | Corte de Cabello Adulto                 |
+----+--------+-------------+----------+------------+-----------------------------------------+

#Selecciona de la tabla reservaciones los elementos guardados con la fecha que cumpla la condicion
mysql> select * from reservaciones where fecha ="2021-06-28";
+----+----------+-------------+----------+------------+-----------------------------------------+
| id | nombre   | apellido    | hora     | fecha      | servicios                               |
+----+----------+-------------+----------+------------+-----------------------------------------+
|  1 | Juan     | De la torre | 10:30:00 | 2021-06-28 | Corte de Cabello Adulto, Corte de Barba |
| 10 | Joaquin  | Muñoz       | 19:00:00 | 2021-06-28 | Tratamiento Capilar                     |
| 14 | Ana      | Preciado    | 14:30:00 | 2021-06-28 | Corte de Cabello Mujer                  |
| 24 | Santiago | Hernandez   | 19:00:00 | 2021-06-28 | Corte de Cabello Niño                   |
| 26 | Miriam   | Dominguez   | 19:00:00 | 2021-06-28 | Corte de Cabello Niño                   |
| 28 | Hugo     | Alonso      | 09:00:00 | 2021-06-28 | Corte de Barba                          |
+----+----------+-------------+----------+------------+-----------------------------------------+

#Condicioal and que permite meter mas de una condicion en el mismo Query
mysql> select * from reservaciones where fecha ="2021-06-28" and id = 1;
+----+--------+-------------+----------+------------+-----------------------------------------+
| id | nombre | apellido    | hora     | fecha      | servicios                               |
+----+--------+-------------+----------+------------+-----------------------------------------+
|  1 | Juan   | De la torre | 10:30:00 | 2021-06-28 | Corte de Cabello Adulto, Corte de Barba |
+----+--------+-------------+----------+------------+-----------------------------------------+

**Normalizacion de basesde datos**

1)Cada columna debe tener un solo valor y no debe haber valores repetidos

2)Llaves primarias compuestas 

3)Cada tabla debe representar solo las caracteriosticas de un elemento en concreto

**Tipos de relaciones entre tablas SQL**

![Imagen de conexiones en bases de datos](relacionesEnBasesDeDatos.png)

Un cliente puede tener muchas citas pero una cita solo pude tener un cliete.

![Imagen de conexiones en bases de datos](relacionUnoAMuchos.png)

**Relacion de uno a muchos**

Un alumno puede tener un salon pero un salon puede tener varios alumnos:
![Imagen de conexiones en bases de datos](uno_a_muchos.png)

alter table nombreTabla add constraint nombreLlave_FK foreign key (campoTabla)
reference nombreOtraTabla (campoOtraTabla) on delete cascade on update;

create database ecuela;
use  escuela;

create table salon(
    id int not null primary key auto_increment,
    grado int not null,
    grupo varchar(2) not null
);

create table alumnos(
    id int not null primary key auto_increment,
    id_salon int not null,
    nombre varchar(100) not null,
    edad int(2) not null
);


#Creando la llave foranea de uno a muchos
alter table alumnos add constraint alumno_salon_fk foreign key(id_salon) 
references salon(id) on delete cascade on update cascade;

#Insertando valores en salon
insert into salon(grupo,grado) values ('A',1),('B',1),('C',1);

select * from salon;
+----+-------+-------+
| id | grado | grupo |
+----+-------+-------+
|  1 |     1 | A     |
|  2 |     1 | B     |
|  3 |     1 | C     |
+----+-------+-------+

#Insertar alumnos
insert into alumnos(id_salon,nombre,edad) values ('1','Gabriel',24),('2','Rodolfo',27),('3','Ximena',21);
select * from alumnos;
+----+----------+---------+------+
| id | id_salon | nombre  | edad |
+----+----------+---------+------+
|  1 |        1 | Gabriel |   24 |
|  2 |        2 | Rodolfo |   27 |
|  3 |        3 | Ximena  |   21 |
|  4 |        1 | Gabriel |   24 |
|  5 |        2 | Rodolfo |   27 |
|  6 |        3 | Ximena  |   21 |
+----+----------+---------+------+

#Borramos el salon 1 y por las llaves foraneas se eliminaran los alumnos con salon 1
delete from salon where id = 1;

select * from alumnos;
+----+----------+---------+------+
| id | id_salon | nombre  | edad |
+----+----------+---------+------+
|  2 |        2 | Rodolfo |   27 |
|  3 |        3 | Ximena  |   21 |
|  5 |        2 | Rodolfo |   27 |
|  6 |        3 | Ximena  |   21 |
+----+----------+---------+------+

otra forma de agregar la llave foranea es con restrict que nos permite evitar que un elemento se borre si es llave foranea de una tabla que tiene elementos guardados

#Borramos la tabla escuela
drop database escuela;

#la creamos de nuevo 
create database escuela;
use escuela;

create table salon(
    id int not null primary key auto_increment,
    grado int not null,
    grupo varchar(2) not null
);

create table alumnos(
    id int not null primary key auto_increment,
    id_salon int not null,
    nombre varchar(100) not null,
    edad int(2) not null
);


#Creando la llave foranea de uno a muchos
alter table alumnos add constraint alumno_salon_fk foreign key(id_salon) 
references salon(id) on delete restrict on update restrict;

#Insertando valores en salon
insert into salon(grupo,grado) values ('A',1),('B',1),('C',1);

select*from salon;
+----+-------+-------+
| id | grado | grupo |
+----+-------+-------+
|  1 |     1 | A     |
|  2 |     1 | B     |
|  3 |     1 | C     |


#Insertar alumnos
insert into alumnos(id_salon,nombre,edad) values ('1','Gabriel',24),('2','Rodolfo',27),('3','Ximena',21);
select * from alumnos;

select*from alumnos;
+----+----------+---------+------+
| id | id_salon | nombre  | edad |
+----+----------+---------+------+
|  1 |        1 | Gabriel |   24 |
|  2 |        2 | Rodolfo |   27 |
|  3 |        3 | Ximena  |   21 |
+----+----------+---------+------+

#Borramos el salon 1 y por las llaves foraneas, esta accion no se permitira ya que existen datos con esas referencia
delete from salon where id = 1;
ERROR 1451 (23000): Cannot delete or update a parent row: a foreign key constraint fails (`escuela`.`alumnos`, CONSTRAINT `alumno_salon_fk` FOREIGN KEY (`id_salon`) REFERENCES `salon` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT)

Otra forma es con el condicional set null que logra hacer que cuando se borra un registro que es llave foranea de otra tabla esta se coloca en null

#Borramos la tabla escuela
drop database escuela;

#la creamos de nuevo 
create database escuela;
use escuela;

create table salon(
    id int not null primary key auto_increment,
    grado int not null,
    grupo varchar(2) not null
);

create table alumnos(
    id int not null primary key auto_increment,
    id_salon int(2),
    nombre varchar(100) not null,
    edad int(2) not null
);


#Creando la llave foranea de uno a muchos
alter table alumnos add constraint alumno_salon_fk foreign key(id_salon) 
references salon(id) on delete set null on update set null;

#Insertando valores en salon
insert into salon(grupo,grado) values ('A',1),('B',1),('C',1);

select*from salon;
+----+-------+-------+
| id | grado | grupo |
+----+-------+-------+
|  1 |     1 | A     |
|  2 |     1 | B     |
|  3 |     1 | C     |


#Insertar alumnos
insert into alumnos(id_salon,nombre,edad) values ('1','Gabriel',24),('2','Rodolfo',27),('3','Ximena',21);
select * from alumnos;

select*from alumnos;
+----+----------+---------+------+
| id | id_salon | nombre  | edad |
+----+----------+---------+------+
|  1 |        1 | Gabriel |   24 |
|  2 |        2 | Rodolfo |   27 |
|  3 |        3 | Ximena  |   21 |
+----+----------+---------+------+

#Borramos el salon 1 y por las llaves foraneas, esta accion no se permitira ya que existen datos con esas referencia
delete from salon where id = 1;

select*from alumnos;
+----+----------+---------+------+
| id | id_salon | nombre  | edad |
+----+----------+---------+------+
|  1 |     NULL | Gabriel |   24 |
|  2 |        2 | Rodolfo |   27 |
|  3 |        3 | Ximena  |   21 |
+----+----------+---------+------+

**Relacion de muchos a muchos**

Un alumno puede teber varios salones pero un salon tambien puede tener varios alumnos:
![Imagen de conexiones en bases de datos](muchos_a_muchos.png)

**Relaciones de uno a uno**

Un intendente de encarga de limpiar solo un salon: 

![image.png](uno_a_uno.png)

**Para este ejercicio haremos la siguiente BD**

![Imagen de conexiones en bases de datos](PrimeraBD.png)

mysql> use appsalon;

#Creamos la tabla clientes 
mysql> create table clientes(
    -> id int(11) not null auto_increment,
    -> nombre varchar(60) not null,
    -> apellido varchar(60) not null,
    -> telefono varchar(10) not null,
    -> email varchar(30) not null unique,
    -> primary key(id)
    -> );

#Insertamos un valor 
mysql> insert into clientes(nombre,apellido,telefono,email) values ("Gabriel","Ordaz","7224085733","tachyordaz123@gmail.com");

#Creamos la tabla servicios
mysql> create table servicios(
    -> id int(11) not null auto_increment,
    -> nombre varchar(60) not null,
    -> precio decimal(6,2) not null,
    -> primary key (id)
    -> );

#Insertamos algunos valores 
    mysql>     INSERT INTO servicios ( nombre, precio ) VALUES
    ->         ('Corte de Cabello Niño', 60),
    ->         ('Corte de Cabello Hombre', 80),
    ->         ('Corte de Barba', 60),
    ->         ('Peinado Mujer', 80),
    ->         ('Peinado Hombre', 60),
    ->         ('Tinte',300),
    ->         ('Uñas', 400),
    ->         ('Lavado de Cabello', 50),
    ->         ('Tratamiento Capilar', 150);


#RELACION DE UNO A MUCHOS 
#Creamos la tabla citas y la relacionamos con la tabla clientes (una cita puede tener solo un cliente pero un 
#cliente puede tener muchas citas)

mysql> create table citas (
    -> id int(11) not null auto_increment,
    -> fecha date not null,
    -> hora time default null,
    -> clienteId int(11) not null,
    -> primary key(id),

    #Hacemos la relacion entre la tabla citas y la tabla clientes
    #Indicamos la variable de la tabla que es una llave foranesa
    -> key clienteId(clienteId),
    #Nombremos la relacion 
    -> constraint cliente_FK
    #Indicamos que la columna elegida esta relacionada con la con la columna id de la tabla clientes 
    -> foreign key(clienteId)
    -> references clientes(id)
    -> );


#Insertamos un valor a la tabla citas teniendo en cuenta que el id del cliente debe existir en la tabla clientes 
#para que el valor sea valido 
mysql> insert into citas(fecha,hora,clienteId) values ("2024-07-28","10:30",1);

mysql> select*from citas;
+----+------------+----------+-----------+
| id | fecha      | hora     | clienteId |
+----+------------+----------+-----------+
|  1 | 2024-07-28 | 10:30:00 |         1 |
+----+------------+----------+-----------+

#Selecciona y une las columnas que coinciden en el valor del id entre las tablas citas y clientes
mysql> select*from citas
    -> inner join clientes on clientes.id=citas.clienteId;
+----+------------+----------+-----------+----+---------+----------+------------+-------------------------+
| id | fecha      | hora     | clienteId | id | nombre  | apellido | telefono   | email                   |
+----+------------+----------+-----------+----+---------+----------+------------+-------------------------+
|  1 | 2024-07-28 | 10:30:00 |         1 |  1 | Gabriel | Ordaz    | 7224085733 | tachyordaz123@gmail.com |
+----+------------+----------+-----------+----+---------+----------+------------+-------------------------+

#El prefijo left hace lo mismo que inner ya que busca las relaciones desde citas y despues coincidencias en clientes
mysql> select*from citas left join clientes on clientes.id=citas.clienteId;
+----+------------+----------+-----------+------+---------+----------+------------+-------------------------+
| id | fecha      | hora     | clienteId | id   | nombre  | apellido | telefono   | email                   |
+----+------------+----------+-----------+------+---------+----------+------------+-------------------------+
|  1 | 2024-07-28 | 10:30:00 |         1 |    1 | Gabriel | Ordaz    | 7224085733 | tachyordaz123@gmail.com |
+----+------------+----------+-----------+------+---------+----------+------------+-------------------------+

#El prefijo right primero busca en clientes y despues en citas 
mysql> select*from citas right join clientes on clientes.id=citas.clienteId;
+------+------------+----------+-----------+----+---------+----------+------------+-------------------------+
| id   | fecha      | hora     | clienteId | id | nombre  | apellido | telefono   | email                   |
+------+------------+----------+-----------+----+---------+----------+------------+-------------------------+
|    1 | 2024-07-28 | 10:30:00 |         1 |  1 | Gabriel | Ordaz    | 7224085733 | tachyordaz123@gmail.com |
| NULL | NULL       | NULL     |      NULL |  2 | Karen   | Perez    | 7224085733 | Karen@gmail.com         |
+------+------------+----------+-----------+----+---------+----------+------------+-------------------------+

#Creamos la tabla intermedia CitasServicios
mysql> create table CitasServicios(
    -> id int(11) auto_increment,
    -> citaId int(11) not null,
    -> servicioId int(11) not null,
    -> primary key(id),
    -> key citaId (citaId),
    -> constraint citas_FK
    -> foreign key (citaId)
    -> references citas (id),
    -> key servicioId (servicioId),
    -> constraint servicio_FK
    -> foreign key (servicioId)
    -> references servicios (id)
    -> );

#Insertamos datos 
mysql> insert into citasservicios (citaId,servicioId) values(1,8);

mysql> select*from citasservicios
    -> left join citas on citas.id = citasservicios.citaId
    -> left join servicios on servicios.id = citasservicios.servicioId;
+----+--------+------------+------+------------+----------+-----------+------+-------------------+--------+
| id | citaId | servicioId | id   | fecha      | hora     | clienteId | id   | nombre            | precio |
+----+--------+------------+------+------------+----------+-----------+------+-------------------+--------+
|  2 |      1 |          8 |    1 | 2024-07-28 | 10:30:00 |         1 |    8 | Lavado de Cabello |  50.00 |
+----+--------+------------+------+------------+----------+-----------+------+-------------------+--------+


#para llamar a todas las tablas relacionadas
mysql> select*from citasservicios
    -> left join citas on citas.id=citasservicios.citaId
    -> left join clientes on citas.clienteid=clientes.id
    -> left join servicios on servicios.id=citasservicios.servicioId;
+----+--------+------------+------+------------+----------+-----------+------+---------+----------+------------+-------------------------+------+-------------------+--------+
| id | citaId | servicioId | id   | fecha      | hora     | clienteId | id   | nombre  | apellido | telefono   | email                   | id   | nombre            | precio |
+----+--------+------------+------+------------+----------+-----------+------+---------+----------+------------+-------------------------+------+-------------------+--------+
|  2 |      1 |          8 |    1 | 2024-07-28 | 10:30:00 |         1 |    1 | Gabriel | Ordaz    | 7224085733 | tachyordaz123@gmail.com |    8 | Lavado de Cabello |  50.00 |
|  3 |      1 |          3 |    1 | 2024-07-28 | 10:30:00 |         1 |    1 | Gabriel | Ordaz    | 7224085733 | tachyordaz123@gmail.com |    3 | Corte de Barba    |  60.00 |
|  4 |      1 |          4 |    1 | 2024-07-28 | 10:30:00 |         1 |    1 | Gabriel | Ordaz    | 7224085733 | tachyordaz123@gmail.com |    4 | Peinado Mujer     |  80.00 |
+----+--------+------------+------+------------+----------+-----------+------+---------+----------+------------+-------------------------+------+-------------------+--------+

**Variables en MySQL**

Las variables se usan para pasar de un valor de una instruccion SQL a otra isntruccion SQL. Para hacer esto,almacena el valor en una veriable definida por el ususario de MYSQL en la primera declaracion y se refiere a ella en las declaraciones siguientes. Para crear una variable definida por el usuario utilice el formato @nombre_variable, donde nombre_variable consta de caracteres alfanumericos. L longitud maxima de la variable definida por el usuario es de 64 caracteres a partir de Mysql 5.7.5 las variables son definidas por el usuario no distinguen entre mayusculas y minusculas. Significa que @id y @ID son iguales

--Declarar una variable: 
set @nombre_variable=5;
--Leer una variable 
select @nombre_variable as alias_variable